{"posts":[{"title":"Paper Reading 1 BIM&amp;CDT","text":"Objectives1. Review and elicit the current state of BIM use during the construction stage; 2. Analyse the components and perceive abilities of Digital Twins as applied across a wide range of engineering domains; 3. Identify current gaps and directions for future research. Summary This article presents a conceptual framework for realizing a CDT mostly based on a review of the existing literature. Outline the current research landscape around the subject of BIM uses. Analysis of the DT paradigm from nearby engineering domains. List several DT abilities or features which would enable real-time, web-integrated, intelligent CDTs. Background The complexity of BIM dimensions and domains. The IFC format was designed for the transferring model, not to be modified or used dynamically——The inclusion of Linked Data and Web Ontology Language models. The Digital Twin paradigm Related WorkAnalysis of the research landscapeDistribution by publication date Provide a structured in-depth view of each identified BIM use during construction. Introduce each identified BIM use Technologies for managing semantics Industry foundation classes There is a low level of IFC adoption concerning nD modeling in general. generate construction sequences based on IFC objects at the task level. import IFC model data and generate a schedule based on materials and pre-defined algorithms. a more recent study outlines the features of a variety of tools supporting IFC and various commercial formats for cost analysis——unlikely to incorporate a 4-5D BIM model. Semantic web ontologies Semantic web and linked data facilitate interoperability between the large spectrums of application domains involved in the construction sector. Outlining the evolution of technologies and information models position the DT to be fully reliant on the IFC schema (in its various file formats), ensuring semantic-rich structured data, which would form the foundation for more efficient ontology-based tools and agents. the level of BIM development towards Digital Twins is still very low, with very few relying on IFC. Cross-domain Digital Twin uses The main challenge of using sensors with DT appears when dealing with the Spatio-temporal resolutions, demanding a successful integration of sensors of different capabilities, reading frequencies, accuracies, their respective locations, and the inter-dependencies between sensor clusters and networks. Identified Digital Twin abilities and their roles within the Virtual-Data-Physical paradigm Construction Digital Twin data usage for facilitating smart construction services Propose an evolutionary 3-tier level CDT paradigmOthers Some conceptions nD BIM: Change the meaning of ‘dimension’, more likely referring to application domains, uses, or use cases of 3D and 4D modeling. Ontologies: A formal way to describe taxonomies and classification networks, essentially defining the structure of knowledge for various domains: the nouns representing classes of objects and the verbs representing relations between the objects. The rationale of the study:","link":"/2022/09/09/Paper-Reading-1-BIM-CDT/"},{"title":"","text":"Paper Reading 1 Topic: Construction quality evaluation of asphalt pavement based on BIM and GIS Keywords: BIM, GIS, Construction simulation, Construction quality Private opinions: Apply the proposed BIM-GIS framework to a project; The methodology is a little unclear; Lack of innovation. Link: Construction quality evaluation of asphalt pavement based on BIM and GIS - ScienceDirect Background Current studies: The evaluation models only focus on one or two processes of pavement construction. Most of the traditional quality evaluation methods sample and evaluate at the end of the pavement construction, which is non-representative and lagging. BIM The strong potential of BIM in road construction management Limitations: The shapes of road structures, a length of hundreds of kilometers. GIS Support the macro-graphic level management of the road network. ContributionA combined framework of BIM and GIS to evaluate the whole-process quality of asphalt pavement construction. A BIM-based model: Using the real-time construction data to make the visual simulation of asphalt pavement. A model based on the analytic hierarchy process (AHP) Evaluate the whole-process quality of asphalt pavement A platform combined with BIM and GIS Show the construction quality evaluation result in GIS. The road mileage information was used to as the connection to locate the corresponding BIM models. A case study Demonstrate the applicability of the framework. Methodology Visual simulation using BIM Dynamo——built a digital surface model Revit——build a 3D road model Navisworks——perform a 4D dynamic simulation Construction quality evaluation system The AHP method construct a hierarchical analysis structure construct judgment matrixes (Weighting) Monitoring data preprocessing for the BIM+GIS platform The division of minimum standard deviation deals with monitoring data——to get representative results. P.S: A little unclear to get the score. Discussion Innovation: Real-time The whole-process Future work: AHP+ neural network: reduce subjectivity. More factors should be considered. Apply the quality evaluation results. Summary Some picture Paper Reading 2 Topic: Comprehensive assessment of embodied environmental impacts of buildings using normalized environmental impact factors Keywords: Embodied environmental impact, Environmental impact factor, BIM, Normalization Private opinions: 1 Link: Comprehensive assessment of embodied environmental impacts of buildings using normalized environmental impact factors - ScienceDirect Background Life cycle assessment(LCA) Challenges Define system boundaries. Obtain complere environmental impact data for building components. Track material flows. Some existing studies focused on a specific aspect of environmental impact of buildings and used a single indicator in life cycle assessment (LCA). Previous studies did not aggregate the results to normalization. Previous studies did not reveal the relationship between the diverse evaluation indicators and various environmental issues. Contribution The proposed framework of the building’s LCEEI assessment MethodologyDiscussion Innovation: Provide a comprehensive assessment of a building’s environmental performance. Normalize the environmental impact factors (EIFs) Reveal how building’s LCEEI are distributed Summary","link":"/2024/03/04/PaperReading/"}],"tags":[{"name":"Paper Reading","slug":"Paper-Reading","link":"/tags/Paper-Reading/"}],"categories":[],"pages":[]}